read_liberty -lib -ignore_miss_dir -setattr blackbox ../vsdsynth//osu018_stdcells.lib 
read_verilog memory.v
synth -top memory
splitnets -ports -format
dfflibmap -liberty ../vsdsynth//osu018_stdcells.lib
opt
abc -liberty ../vsdsynth//osu018_stdcells.lib
flatten
clean -purge
opt
clean
write_verilog memory_synth.v
